InformationRegisters/РазделыДатЗапретаИзмененияОбъектовБЗК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РазделыДатЗапретаИзмененияОбъектовБЗК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Применение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РазделСсылка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РазделыДатЗапретаИзмененияОбъектовБЗК/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОбновитьВерсиюДатЗапретаИзменения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Поле = Элементы.Применение Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		ИзменитьПрименениеЗаписи(ТекущиеДанные.РазделСсылка, ТекущиеДанные.ОбъектМетаданных,
			ТекущиеДанные.ПолеДаты, ТекущиеДанные.ПолеОбъекта);
		
		ОповеститьОбИзмененииНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("РегистрСведенийКлючЗаписи.РазделыДатЗапретаИзмененияОбъектовБЗК") Тогда
			
			ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
			Если ДанныеСтроки.Предопределенный Тогда
				ПоказатьПредупреждение(, НСтр("ru = 'Нельзя удалять предопределенную настройку'"));
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьПрименение(Команда)
	
	Если ИзменитьПрименениеНаСервере() Тогда
		ОповеститьОбИзмененииНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкуПоУмолчанию(Команда)
	
	ВосстановитьНастройкуНаСервере();
	ОповеститьОбИзмененииНастроек();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьПрименениеЗаписи(Знач РазделСсылка, Знач ОбъектМетаданных, Знач ПолеДаты, Знач ПолеОбъекта)
	
	РегистрыСведений.РазделыДатЗапретаИзмененияОбъектовБЗК.ИзменитьПрименениеЗаписи(
		РазделСсылка, ОбъектМетаданных, ПолеДаты, ПолеОбъекта);
	
КонецПроцедуры

&НаСервере
Функция ИзменитьПрименениеНаСервере()
	
	ОбновитьСписок = Ложь;
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("РегистрСведенийКлючЗаписи.РазделыДатЗапретаИзмененияОбъектовБЗК") Тогда
			
			ОбновитьСписок = Истина;
			ИзменитьПрименениеЗаписи(ВыделеннаяСтрока.РазделСсылка, ВыделеннаяСтрока.ОбъектМетаданных,
				ВыделеннаяСтрока.ПолеДаты, ВыделеннаяСтрока.ПолеОбъекта);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбновитьСписок;
	
КонецФункции

&НаСервере
Процедура ВосстановитьНастройкуНаСервере()
	
	РегистрыСведений.РазделыДатЗапретаИзмененияОбъектовБЗК.ВосстановитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииНастроек()
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.РазделыДатЗапретаИзмененияОбъектовБЗК"));
	ОбновитьВерсиюДатЗапрета = Истина;
	ПодключитьОбработчикОжидания("ОбновитьВерсиюДатЗапретаИзменения", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВерсиюДатЗапретаИзменения()
	
	Если ОбновитьВерсиюДатЗапрета Тогда
		ОбновитьВерсиюДатЗапретаИзмененияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВерсиюДатЗапретаИзмененияНаСервере()
	
	ДатыЗапретаИзмененияСлужебный.ОбновитьВерсиюДатЗапретаИзменения();
	ОбновитьВерсиюДатЗапрета = Ложь;
	
КонецПроцедуры

#КонецОбласти
